"use strict";
// Создайте скрипт турагенства, продающего поездки в 3-х группах: sharm, hurgada и taba.

// Кол-во мест в группах ограничено: sharm - 15, hurgada - 25, taba - 6.

// Когда пользователь посещает страницу, ему необходимо предложить ввести число необходимых мест,
// результат сохранить в переменную.

// Необходимо проверить является ли введенные данные целым положительным числом.
// Вывести alert с текстом "Ошибка ввода" в случае ошибочного ввода и прекратить выполнение скрипта.

// В случае валидного ввода, последовательно проверить кол-во мест в группах,
// и кол-во необходимых мест введенных пользователем.
// Подсказка: начните с самой маленькой группы!

// Если была найдена группа в которой количество мест больше либо равно необходимому,
// вывести пользователю сообщение через confirm, что есть место в группе такой-то,
// согласен ли пользоваетель быть в этой группе?

// Если ответ да, уменьшаем число свободных мест на число участников группы и выводим alert с текстом,
// 'Приятного путешествия в группе <имя группы>'.

// Если ответ нет, выводим alert с текстом "Нам очень жаль, приходите еще!".

// Если мест нигде нет, выводим alert с сообщением 'Извините, мест нет.'

// ***Задание повышеной сложности, выполнять по желанию***

// Если была найдена группа в которой количество мест больше либо равно необходимому,
// вывести пользователю сообщение через confirm, что есть место в группе такой-то,
// согласен ли пользоваетель быть в этой группе?

// Если ответ да, уменьшаем число свободных мест на число участников группы и выводим alert с текстом,
// 'Приятного путешествия в группе <имя группы>'.

// Если ответ нет, проверяем дальше и предлагаем следующую группу со свободными местами,
// если таковая будет найдена. Проверяем до тех пор, пока не проверим все 3 воможные группы.

// Если мест нигде нет, выводим alert с сообщением 'Извините, мест нет.'
let tours = {
  sharm: {
    total: 15,
    free: 15,
    booked: 0
  },

  hurgada: {
    total: 25,
    free: 25,
    booked: 0
  },

  taba: {
    total: 6,
    free: 6,
    booked: 0
  }
};

let places = prompt("Введите количество мест?", 1);

if (isNaN(places) === true) {
  alert("Ошибка ввода");
} else if (places % 1 === 0 && places > 0) {
  for (let place in tours) {
    if (tours[place].free >= places) {
      let toConfirm = confirm(
        `Есть свободные места в группе ${place}, вы хотите присоединиться?`
      );
      if (toConfirm === true) {
        alert(`Приятного путешествия в группе ${place}`);
        tours[place].free = tours[place].free - places.length;
        break;
      } else {
        alert("Нам очень жаль, приходите еще!");
        break;
      }
    }
  }

} else {
  alert("Ошибка ввода");
}
